app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "evaluation") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aa"], ["user_id", 2], ["created_at", "2021-11-10 08:27:19.231399"], ["updated_at", "2021-11-10 08:27:19.231399"], ["evaluation", 2.0]]
SELECT "books".* FROM "books"

  def ensure_correct_user
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]